def tea_text() -> str:
    return (
        "<b>Выбери чайный напиток:</b>\n\n"
        "1. Чай «Гранатовый пунш» - гранат, малина, цветки гибискуса\n"
        "2. Чай «Облепиховый пунш» - облепиха, апельсин, ананас, яблоко"
    )


def chocolate_text() -> str:
    return (
        "<b>Выбери вкус шоколада:</b>\n\n"
        "1. Молочный с кофе\n"
        "2. Молочный с клубникой\n"
        "3. Белый с фисташкой и клубникой"
    )


def candle_text() -> str:
    return (
        "<b>Выбери ароматическую свечку:</b>\n\n"
        "1. Свеча «Тыквенный пирог» - тыква, мускат, ваниль\n"
        "2. Свеча «Пряная груша» - груша, гвоздика, корица\n"
        "3. Свеча «Черничный маффин» - черника, смородина, свежая выпечка"
    )
