def start_message() -> str:
    return (
        "Привет, котёнок! Здесь ты можешь заказать свой идеальный осенний бокс 🦔✨\n\n"
        "Есть три вида с разным наполнением:\n\n"
        "<b>1. Бокс за 1990р</b> – 3 открытки, 2 стикерпака, брелок, закладка для книг, ароматическая свеча, шоколад, чайный пунш, декоративная тыква, арома-саше\n\n"
        "<b>2. Бокс за 2990р</b> – всё что в первом боксе + магнит ручной работы\n\n"
        "<b>3. Бокс за 4990р</b> – всё что в первом боксе + магнит ручной работы + шоппер с росписью\n\n"
        "<i>Выбери один их них и пойдем дальше!</i>"
    )
