def cards_in_stock_text() -> str:
    return (
        "<b>Выбери открытку:</b>\n\n"
        "1. Открытка «Кот на розовом»\n"
        "2. Открытка «Кот в поезде»\n"
        "3. Открытка «PIZDEC»\n"
        "4. Открытка «Трудные времена»\n"
    )


def hedgehog_card_text() -> str:
    return (
        "<b>Выбери надпись на открытке:</b>\n\n"
        "1. «Два ежа смотрят друг на друга»\n"
        "2. «Ты пушистей»"
    )


def stickers_color_text() -> str:
    return (
        "<b>Выбери расцветку стикеров:</b>\n\n"
        "1. Черно-белый котики\n"
        "2. Черно-рыжий котики\n"
        "3. Серые котики"
    )
